fixtures/demo_my_test/src/Documents/ОперацияПоУчетуТоваров/ОперацияПоУчетуТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОперацияПоУчетуТоваров</name>
  <posting>Deny</posting>
  <registerRecords>AccumulationRegister.ТоварныеЗапасы</registerRecords>
  <attributes>
    <name>СодержаниеОперации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:Document>

fixtures/demo_my_test/src/AccumulationRegisters/ТоварныеЗапасы/ТоварныеЗапасы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварныеЗапасы</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fixtures/demo_my_test/src/Documents/ОперацияПоУчетуТоваров/ObjectModule.bsl
//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

//////////////////////////////////////////////////////////////////////////////// 
// ОБРАБОТЧИКИ СОБЫТИЙ 
// 

// Обработчик копирования документа выполняет также копирование движений
Процедура ПриКопировании(ОбъектКопирования)
	ОбъектКопирования.Движения.ТоварныеЗапасы.Прочитать();
    Для Каждого ИсхЗапись Из ОбъектКопирования.Движения.ТоварныеЗапасы Цикл
		Запись = Движения.ТоварныеЗапасы.Добавить();
		Запись.ВидДвижения = ИсхЗапись.ВидДвижения;
		Запись.Товар = ИсхЗапись.Товар;
		Запись.Склад = ИсхЗапись.Склад;
		Запись.Количество = ИсхЗапись.Количество;
	КонецЦикла;
КонецПроцедуры

// Обработчик события, предшествующего записи, устанавливает всем
// движениям дату самого документа
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Для Каждого Запись Из Движения.ТоварныеЗапасы Цикл
		Запись.Период = Дата;
	КонецЦикла;
	
КонецПроцедуры
